In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Pandas fill null or NaN when there is no value.
### We can drop the column or row if there is one or more NaN value presents

In [3]:
df.dropna()

     A    B  C
0  1.0  3.0  1

In [4]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [6]:
# Thresh - it will drop the row if there is that many values are not present. 
# It should have atleast thresh number of non Nan Values
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2

### Fill to replace NaN value with something else

In [8]:
df.fillna(value='Fill Value')

            A           B  C
0           1           3  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [9]:
df['A'].mean()

1.5

In [11]:
# Fill with mean value of the volumn
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64